app/controllers/episodes_controller.rb

SELECT `episodes`.* FROM `episodes`
---
  def index
    @episodes = Episode.all

SELECT `episodes`.* FROM `episodes` WHERE `episodes`.`id` = 1 LIMIT 1
---
  def edit
    @episode = Episode.find(params[:id])

SELECT `episodes`.* FROM `episodes` WHERE `episodes`.`id` = 0 LIMIT 1
---
  def show
    @episode = Episode.find(params[:id])

INSERT INTO `episodes` (`audio_content_type`, `audio_file_name`, `audio_file_size`, `audio_updated_at`, `author`, `created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `pub_date`, `subtitle`, `summary`, `title`, `updated_at`) VALUES ('audio/mp3', '19498_Hunger_Original_Mix.mp3', 11213435, '2014-06-15 17:49:31', 'Jeramy', '2014-06-15 17:49:31', 'image/png', '2014-05-09_1026.png', 126970, '2014-06-15 17:49:31', '2014-06-15', 'shizzz!', 'The summary', 'Derp show', '2014-06-15 17:49:31')
---
  def create
    @episode = Episode.new(episode_params)
    if @episode.save

SELECT `episodes`.* FROM `episodes` WHERE `episodes`.`id` = 1 LIMIT 1
UPDATE `episodes` SET `summary` = 'The summary, ok', `updated_at` = '2014-06-16 06:45:43' WHERE `episodes`.`id` = 1
---
  def update
    @episode = Episode.find(params[:id])
    if @episode.update_attributes(episode_params)